/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 41;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __LDOUBLE_REDIRECTS_TO_FLOAT128_ABI: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C23: u32 = 0;
pub const __GLIBC_USE_IEC_60559_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C23: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __KERNEL_OLD_TIMEVAL_MATCHES_TIMEVAL64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const _BITS_STDINT_LEAST_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const _UCHAR_H: u32 = 1;
pub const __mbstate_t_defined: u32 = 1;
pub const ____mbstate_t_defined: u32 = 1;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub type C__u_char = ::std::os::raw::c_uchar;
pub type C__u_short = ::std::os::raw::c_ushort;
pub type C__u_int = ::std::os::raw::c_uint;
pub type C__u_long = ::std::os::raw::c_ulong;
pub type C__int8_t = ::std::os::raw::c_schar;
pub type C__uint8_t = ::std::os::raw::c_uchar;
pub type C__int16_t = ::std::os::raw::c_short;
pub type C__uint16_t = ::std::os::raw::c_ushort;
pub type C__int32_t = ::std::os::raw::c_int;
pub type C__uint32_t = ::std::os::raw::c_uint;
pub type C__int64_t = ::std::os::raw::c_long;
pub type C__uint64_t = ::std::os::raw::c_ulong;
pub type C__int_least8_t = C__int8_t;
pub type C__uint_least8_t = C__uint8_t;
pub type C__int_least16_t = C__int16_t;
pub type C__uint_least16_t = C__uint16_t;
pub type C__int_least32_t = C__int32_t;
pub type C__uint_least32_t = C__uint32_t;
pub type C__int_least64_t = C__int64_t;
pub type C__uint_least64_t = C__uint64_t;
pub type C__quad_t = ::std::os::raw::c_long;
pub type C__u_quad_t = ::std::os::raw::c_ulong;
pub type C__intmax_t = ::std::os::raw::c_long;
pub type C__uintmax_t = ::std::os::raw::c_ulong;
pub type C__dev_t = ::std::os::raw::c_ulong;
pub type C__uid_t = ::std::os::raw::c_uint;
pub type C__gid_t = ::std::os::raw::c_uint;
pub type C__ino_t = ::std::os::raw::c_ulong;
pub type C__ino64_t = ::std::os::raw::c_ulong;
pub type C__mode_t = ::std::os::raw::c_uint;
pub type C__nlink_t = ::std::os::raw::c_ulong;
pub type C__off_t = ::std::os::raw::c_long;
pub type C__off64_t = ::std::os::raw::c_long;
pub type C__pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug)]
pub struct C__fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of C__fsid_t"][::std::mem::size_of::<C__fsid_t>() - 8usize];
    ["Alignment of C__fsid_t"][::std::mem::align_of::<C__fsid_t>() - 4usize];
    ["Offset of field: C__fsid_t::__val"][::std::mem::offset_of!(C__fsid_t, __val) - 0usize];
};
pub type C__clock_t = ::std::os::raw::c_long;
pub type C__rlim_t = ::std::os::raw::c_ulong;
pub type C__rlim64_t = ::std::os::raw::c_ulong;
pub type C__id_t = ::std::os::raw::c_uint;
pub type C__time_t = ::std::os::raw::c_long;
pub type C__useconds_t = ::std::os::raw::c_uint;
pub type C__suseconds_t = ::std::os::raw::c_long;
pub type C__suseconds64_t = ::std::os::raw::c_long;
pub type C__daddr_t = ::std::os::raw::c_int;
pub type C__key_t = ::std::os::raw::c_int;
pub type C__clockid_t = ::std::os::raw::c_int;
pub type C__timer_t = *mut ::std::os::raw::c_void;
pub type C__blksize_t = ::std::os::raw::c_long;
pub type C__blkcnt_t = ::std::os::raw::c_long;
pub type C__blkcnt64_t = ::std::os::raw::c_long;
pub type C__fsblkcnt_t = ::std::os::raw::c_ulong;
pub type C__fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type C__fsfilcnt_t = ::std::os::raw::c_ulong;
pub type C__fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type C__fsword_t = ::std::os::raw::c_long;
pub type C__ssize_t = ::std::os::raw::c_long;
pub type C__syscall_slong_t = ::std::os::raw::c_long;
pub type C__syscall_ulong_t = ::std::os::raw::c_ulong;
pub type C__loff_t = C__off64_t;
pub type C__caddr_t = *mut ::std::os::raw::c_char;
pub type C__intptr_t = ::std::os::raw::c_long;
pub type C__socklen_t = ::std::os::raw::c_uint;
pub type C__sig_atomic_t = ::std::os::raw::c_int;
pub type Cint_least8_t = C__int_least8_t;
pub type Cint_least16_t = C__int_least16_t;
pub type Cint_least32_t = C__int_least32_t;
pub type Cint_least64_t = C__int_least64_t;
pub type Cuint_least8_t = C__uint_least8_t;
pub type Cuint_least16_t = C__uint_least16_t;
pub type Cuint_least32_t = C__uint_least32_t;
pub type Cuint_least64_t = C__uint_least64_t;
pub type Cint_fast8_t = ::std::os::raw::c_schar;
pub type Cint_fast16_t = ::std::os::raw::c_long;
pub type Cint_fast32_t = ::std::os::raw::c_long;
pub type Cint_fast64_t = ::std::os::raw::c_long;
pub type Cuint_fast8_t = ::std::os::raw::c_uchar;
pub type Cuint_fast16_t = ::std::os::raw::c_ulong;
pub type Cuint_fast32_t = ::std::os::raw::c_ulong;
pub type Cuint_fast64_t = ::std::os::raw::c_ulong;
pub type Cintmax_t = C__intmax_t;
pub type Cuintmax_t = C__uintmax_t;
#[repr(C)]
pub struct C__mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: C__mbstate_t__bindgen_ty_1,
}
#[repr(C)]
pub struct C__mbstate_t__bindgen_ty_1 {
    pub __wch: __BindgenUnionField<::std::os::raw::c_uint>,
    pub __wchb: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub bindgen_union_field: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of C__mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<C__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of C__mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<C__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: C__mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(C__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: C__mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(C__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of C__mbstate_t"][::std::mem::size_of::<C__mbstate_t>() - 8usize];
    ["Alignment of C__mbstate_t"][::std::mem::align_of::<C__mbstate_t>() - 4usize];
    ["Offset of field: C__mbstate_t::__count"]
        [::std::mem::offset_of!(C__mbstate_t, __count) - 0usize];
    ["Offset of field: C__mbstate_t::__value"]
        [::std::mem::offset_of!(C__mbstate_t, __value) - 4usize];
};
pub type Cmbstate_t = C__mbstate_t;
pub type Cchar16_t = C__uint_least16_t;
pub type Cchar32_t = C__uint_least32_t;
unsafe extern "C" {
    pub fn mbrtoc16(
        __pc16: *mut Cchar16_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
        __p: *mut Cmbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn c16rtomb(
        __s: *mut ::std::os::raw::c_char,
        __c16: Cchar16_t,
        __ps: *mut Cmbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mbrtoc32(
        __pc32: *mut Cchar32_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
        __p: *mut Cmbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn c32rtomb(
        __s: *mut ::std::os::raw::c_char,
        __c32: Cchar32_t,
        __ps: *mut Cmbstate_t,
    ) -> usize;
}
pub type Ci8 = i8;
pub type Ci16 = i16;
pub type Ci32 = i32;
pub type Ci64 = i64;
pub type Ci128 = C__int128_t;
pub type Cu8 = u8;
pub type Cu16 = u16;
pub type Cu32 = u32;
pub type Cu64 = u64;
pub type Cu128 = C__uint128_t;
pub type Cusize = usize;
pub type Cisize = C__ssize_t;
pub type Cc8 = ::std::os::raw::c_uchar;
pub type Cc16 = Cchar16_t;
pub type Cc32 = Cchar32_t;
pub type Cf32 = f32;
pub type Cf64 = f64;
pub type Cf128 = u128;
pub type Cfmax = Cf128;
pub type CContextSupplier = ::std::option::Option<unsafe extern "C" fn() -> CApplicationContext>;
#[repr(C)]
#[derive(Debug)]
pub struct CUuid {
    pub higher: Cu64,
    pub lower: Cu64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUuid"][::std::mem::size_of::<CUuid>() - 16usize];
    ["Alignment of CUuid"][::std::mem::align_of::<CUuid>() - 8usize];
    ["Offset of field: CUuid::higher"][::std::mem::offset_of!(CUuid, higher) - 0usize];
    ["Offset of field: CUuid::lower"][::std::mem::offset_of!(CUuid, lower) - 8usize];
};
#[repr(u32)]
#[derive(Debug, Clone, Hash, PartialEq, Eq)]
pub enum CServiceError {
    Success = 0,
    CoreInternalError = 1,
    PluginInternalError = 2,
    NullFunctionPointer = 3,
    InvalidString = 4,
    InvalidJson = 5,
    InvalidSchema = 6,
    InvalidApi = 7,
    NotFound = 8,
    Unauthorized = 9,
    Duplicate = 10,
    PluginUninit = 11,
    ShutingDown = 12,
}
pub type CStringDealloc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const Cc8, arg2: Cusize)>;
#[repr(C)]
#[derive(Debug)]
pub struct CString {
    pub internal: [Cu8; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CString"][::std::mem::size_of::<CString>() - 24usize];
    ["Alignment of CString"][::std::mem::align_of::<CString>() - 1usize];
    ["Offset of field: CString::internal"][::std::mem::offset_of!(CString, internal) - 0usize];
};
unsafe extern "C" {
    pub fn createString(arg1: *const Cc8, arg2: Cusize, arg3: CStringDealloc) -> CString;
}
unsafe extern "C" {
    pub fn destroyString(arg1: *mut CString);
}
unsafe extern "C" {
    pub fn isValidString(arg1: *const CString) -> bool;
}
unsafe extern "C" {
    pub fn getCharString(arg1: *const CString, arg2: Cusize) -> Cc8;
}
unsafe extern "C" {
    pub fn getLengthString(arg1: *const CString) -> Cusize;
}
unsafe extern "C" {
    pub fn getViewString(arg1: *const CString, arg2: Cusize, arg3: Cusize) -> *const Cc8;
}
pub type CStringListDeallocFP =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut CString, arg2: Cu32)>;
#[repr(C)]
#[derive(Debug)]
pub struct CList_String {
    pub dealloc_fn: CStringListDeallocFP,
    pub data: *mut CString,
    pub length: Cu32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CList_String"][::std::mem::size_of::<CList_String>() - 24usize];
    ["Alignment of CList_String"][::std::mem::align_of::<CList_String>() - 8usize];
    ["Offset of field: CList_String::dealloc_fn"]
        [::std::mem::offset_of!(CList_String, dealloc_fn) - 0usize];
    ["Offset of field: CList_String::data"][::std::mem::offset_of!(CList_String, data) - 8usize];
    ["Offset of field: CList_String::length"]
        [::std::mem::offset_of!(CList_String, length) - 16usize];
};
unsafe extern "C" {
    pub fn isValidListString(arg1: *const CList_String) -> bool;
}
unsafe extern "C" {
    pub fn createListString(
        data: *mut CString,
        length: Cu32,
        dealloc_fn: CStringListDeallocFP,
    ) -> CList_String;
}
unsafe extern "C" {
    pub fn destroyListString(list: *mut CList_String);
}
unsafe extern "C" {
    pub fn getListString(list: *mut CList_String, index: Cu32) -> *mut CString;
}
unsafe extern "C" {
    pub fn emptyListString() -> CList_String;
}
pub type CEventHandlerFP =
    ::std::option::Option<unsafe extern "C" fn(arg1: CContextSupplier, arg2: CString)>;
#[repr(C)]
#[derive(Debug)]
pub struct CEventHandler {
    pub function: CEventHandlerFP,
    pub handler_id: CUuid,
    pub error: CServiceError,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CEventHandler"][::std::mem::size_of::<CEventHandler>() - 32usize];
    ["Alignment of CEventHandler"][::std::mem::align_of::<CEventHandler>() - 8usize];
    ["Offset of field: CEventHandler::function"]
        [::std::mem::offset_of!(CEventHandler, function) - 0usize];
    ["Offset of field: CEventHandler::handler_id"]
        [::std::mem::offset_of!(CEventHandler, handler_id) - 8usize];
    ["Offset of field: CEventHandler::error"]
        [::std::mem::offset_of!(CEventHandler, error) - 24usize];
};
pub type CEventHandlerRegisterService = ::std::option::Option<
    unsafe extern "C" fn(arg1: CEventHandlerFP, arg2: CUuid, arg3: CString) -> CEventHandler,
>;
pub type CEventHandlerUnregisterService = ::std::option::Option<
    unsafe extern "C" fn(arg1: CUuid, arg2: CUuid, arg3: CString) -> CServiceError,
>;
pub type CEventRegisterService = ::std::option::Option<
    unsafe extern "C" fn(arg1: CString, arg2: CUuid, arg3: CString) -> CServiceError,
>;
pub type CEventUnregisterService =
    ::std::option::Option<unsafe extern "C" fn(arg1: CUuid, arg2: CString) -> CServiceError>;
pub type CEventTriggerService = ::std::option::Option<
    unsafe extern "C" fn(arg1: CUuid, arg2: CString, arg3: CString) -> CServiceError,
>;
#[repr(C)]
#[derive(Debug)]
pub struct CEndpointResponse {
    pub response: CString,
    pub error: CServiceError,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CEndpointResponse"][::std::mem::size_of::<CEndpointResponse>() - 28usize];
    ["Alignment of CEndpointResponse"][::std::mem::align_of::<CEndpointResponse>() - 4usize];
    ["Offset of field: CEndpointResponse::response"]
        [::std::mem::offset_of!(CEndpointResponse, response) - 0usize];
    ["Offset of field: CEndpointResponse::error"]
        [::std::mem::offset_of!(CEndpointResponse, error) - 24usize];
};
pub type CRequestHandlerFP = ::std::option::Option<
    unsafe extern "C" fn(arg1: CContextSupplier, arg2: CString) -> CEndpointResponse,
>;
pub type CEndpointRegisterService = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CString,
        arg2: CString,
        arg3: CUuid,
        arg4: CString,
        arg5: CRequestHandlerFP,
    ) -> CServiceError,
>;
pub type CEndpointUnregisterService =
    ::std::option::Option<unsafe extern "C" fn(arg1: CUuid, arg2: CString) -> CServiceError>;
pub type CEndpointRequestService =
    ::std::option::Option<unsafe extern "C" fn(arg1: CString, arg2: CString) -> CEndpointResponse>;
pub type Cwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug)]
pub struct Cmax_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Cmax_align_t"][::std::mem::size_of::<Cmax_align_t>() - 32usize];
    ["Alignment of Cmax_align_t"][::std::mem::align_of::<Cmax_align_t>() - 16usize];
    ["Offset of field: Cmax_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(Cmax_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: Cmax_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(Cmax_align_t, __clang_max_align_nonce2) - 16usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct CApplicationContext {
    pub handlerRegisterService: CEventHandlerRegisterService,
    pub handlerUnregisterService: CEventHandlerUnregisterService,
    pub eventRegisterService: CEventRegisterService,
    pub eventUnregisterService: CEventUnregisterService,
    pub eventTriggerService: CEventTriggerService,
    pub endpointRegisterService: CEndpointRegisterService,
    pub endpointUnregisterService: CEndpointUnregisterService,
    pub endpointRequestService: CEndpointRequestService,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CApplicationContext"][::std::mem::size_of::<CApplicationContext>() - 64usize];
    ["Alignment of CApplicationContext"][::std::mem::align_of::<CApplicationContext>() - 8usize];
    ["Offset of field: CApplicationContext::handlerRegisterService"]
        [::std::mem::offset_of!(CApplicationContext, handlerRegisterService) - 0usize];
    ["Offset of field: CApplicationContext::handlerUnregisterService"]
        [::std::mem::offset_of!(CApplicationContext, handlerUnregisterService) - 8usize];
    ["Offset of field: CApplicationContext::eventRegisterService"]
        [::std::mem::offset_of!(CApplicationContext, eventRegisterService) - 16usize];
    ["Offset of field: CApplicationContext::eventUnregisterService"]
        [::std::mem::offset_of!(CApplicationContext, eventUnregisterService) - 24usize];
    ["Offset of field: CApplicationContext::eventTriggerService"]
        [::std::mem::offset_of!(CApplicationContext, eventTriggerService) - 32usize];
    ["Offset of field: CApplicationContext::endpointRegisterService"]
        [::std::mem::offset_of!(CApplicationContext, endpointRegisterService) - 40usize];
    ["Offset of field: CApplicationContext::endpointUnregisterService"]
        [::std::mem::offset_of!(CApplicationContext, endpointUnregisterService) - 48usize];
    ["Offset of field: CApplicationContext::endpointRequestService"]
        [::std::mem::offset_of!(CApplicationContext, endpointRequestService) - 56usize];
};
#[repr(C)]
#[derive(Debug, Clone)]
pub struct CApiVersion {
    pub major: Cu16,
    pub feature: Cu8,
    pub patch: Cu8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CApiVersion"][::std::mem::size_of::<CApiVersion>() - 4usize];
    ["Alignment of CApiVersion"][::std::mem::align_of::<CApiVersion>() - 2usize];
    ["Offset of field: CApiVersion::major"][::std::mem::offset_of!(CApiVersion, major) - 0usize];
    ["Offset of field: CApiVersion::feature"]
        [::std::mem::offset_of!(CApiVersion, feature) - 2usize];
    ["Offset of field: CApiVersion::patch"][::std::mem::offset_of!(CApiVersion, patch) - 3usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct CPluginInfo {
    pub name: CString,
    pub version: CString,
    pub dependencies: CList_String,
    pub initHandler: CEventHandlerFP,
    pub apiVersion: CApiVersion,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CPluginInfo"][::std::mem::size_of::<CPluginInfo>() - 88usize];
    ["Alignment of CPluginInfo"][::std::mem::align_of::<CPluginInfo>() - 8usize];
    ["Offset of field: CPluginInfo::name"][::std::mem::offset_of!(CPluginInfo, name) - 0usize];
    ["Offset of field: CPluginInfo::version"]
        [::std::mem::offset_of!(CPluginInfo, version) - 24usize];
    ["Offset of field: CPluginInfo::dependencies"]
        [::std::mem::offset_of!(CPluginInfo, dependencies) - 48usize];
    ["Offset of field: CPluginInfo::initHandler"]
        [::std::mem::offset_of!(CPluginInfo, initHandler) - 72usize];
    ["Offset of field: CPluginInfo::apiVersion"]
        [::std::mem::offset_of!(CPluginInfo, apiVersion) - 80usize];
};
unsafe extern "C" {
    pub static API_VERSION: CApiVersion;
}
unsafe extern "C" {
    pub fn plugin_main(arg1: CUuid) -> CPluginInfo;
}
pub type C__int128_t = i128;
pub type C__uint128_t = u128;
